#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=4e60e6b0-61a3-4a70-9a60-4a252f3e7c7c]
module.frontend.aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E2KG39NGUA7DI2]
module.frontend.aws_acm_certificate.ssl: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/3f355d4e-762e-4305-a1de-b04e42a54abd]
module.frontend.aws_s3_bucket.bucket: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_route53_record.example["video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME]
module.frontend.aws_acm_certificate_validation.ssl: Refreshing state... [id=2022-01-23 21:54:35.297 +0000 UTC]
module.frontend.aws_route53_record.example["www.video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2QZVOHCSCH69J]
module.frontend.aws_route53_record.subdomain_root: Refreshing state... [id=Z1M325FGK1MICN_video_A]
module.frontend.aws_route53_record.subdomain_www[0]: Refreshing state... [id=Z1M325FGK1MICN_www.video_A]
module.frontend.aws_s3_bucket_public_access_block.bucket_pab: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_s3_bucket_object.frontend["index.html"]: Refreshing state... [id=index.html]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.frontend.aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E2QZVOHCSCH69J"
        tags                           = {
            "Environment" = "video.rayprogramming.com"
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ default_ttl              = 0 -> 3600
          ~ max_ttl                  = 0 -> 86400
            # (11 unchanged attributes hidden)
        }




        # (4 unchanged blocks hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend["favicon.ico"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/x-icon"
      + etag                   = "1ba2ae710d927f13d483fd5d1e548c9b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/dist/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_object.frontend["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "frontend" {
      ~ etag               = "31a35f3ffb882b7b92e9f56fcc54c0ee" -> "4a59c0b09abf7efc996f4b7344b98d41"
        id                 = "index.html"
      ~ source             = "frontend/../../frontend/index.html" -> "frontend/../../frontend/dist/index.html"
        tags               = {}
      ~ version_id         = "6s9YwvNxps1t7cYbCcGhX90hOTNuhEjv" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend["manifest.json"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "4b14c64efaf846819b9a229b4193c8b7"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/dist/manifest.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_object.frontend["precache-manifest.0d295b3068ed12c42c79dc21c6e16191.js"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "0d295b3068ed12c42c79dc21c6e16191"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "precache-manifest.0d295b3068ed12c42c79dc21c6e16191.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/dist/precache-manifest.0d295b3068ed12c42c79dc21c6e16191.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_object.frontend["robots.txt"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain"
      + etag                   = "b6216d61c03e6ce0c9aea6ca7808f7ca"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "robots.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/dist/robots.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_object.frontend["service-worker.js"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "e50591b433c2632313146c944f213347"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "service-worker.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/dist/service-worker.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 5 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*